In [1]:
import pandas as pd

In [2]:
people= {
    "first" :["Ania", "Marysia", "Ola"],       
    "last" :["Osten", "Marck", "Sir"],
    "email": ["@gmail", "@pl", "@.com"]}

In [3]:
people

{'first': ['Ania', 'Marysia', 'Ola'],
 'last': ['Osten', 'Marck', 'Sir'],
 'email': ['@gmail', '@pl', '@.com']}

In [4]:
nazwa=pd.DataFrame(people)

In [5]:
nazwa

     first   last   email
0     Ania  Osten  @gmail
1  Marysia  Marck     @pl
2      Ola    Sir   @.com

In [6]:
nazwa.columns=['first_name', 'last', 'email']

In [7]:
nazwa

  first_name   last   email
0       Ania  Osten  @gmail
1    Marysia  Marck     @pl
2        Ola    Sir   @.com

In [8]:
nazwa.columns =[x.upper() for x in nazwa.columns]

In [9]:
nazwa

  FIRST_NAME   LAST   EMAIL
0       Ania  Osten  @gmail
1    Marysia  Marck     @pl
2        Ola    Sir   @.com

In [10]:
nazwa.columns = nazwa.columns.str.replace('L',' ')

In [11]:
nazwa

  FIRST_NAME    AST   EMAI
0       Ania  Osten  @gmail
1    Marysia  Marck     @pl
2        Ola    Sir   @.com

In [12]:
nazwa.columns = nazwa.columns.str.replace(' ','L')

In [13]:
nazwa

  FIRST_NAME   LAST   EMAIL
0       Ania  Osten  @gmail
1    Marysia  Marck     @pl
2        Ola    Sir   @.com

In [18]:
nazwa.columns = nazwa.columns.str.replace('A','m')

In [19]:
nazwa

  FIRST_NmME   LmST   EMmIL
0       Ania  Osten  @gmail
1    Marysia  Marck     @pl
2        Ola    Sir   @.com

In [20]:
nazwa.columns =[x.lower() for x in nazwa.columns]

In [21]:
nazwa

  first_nmme   lmst   emmil
0       Ania  Osten  @gmail
1    Marysia  Marck     @pl
2        Ola    Sir   @.com

In [22]:
nazwa.columns = nazwa.columns.str.replace('m','A')

In [23]:
nazwa

  first_nAAe   lAst   eAAil
0       Ania  Osten  @gmail
1    Marysia  Marck     @pl
2        Ola    Sir   @.com

In [24]:
nazwa.rename(columns='first_nAAe':'first', 'lAst':'last', 'eAAil':'email'])

SyntaxError: invalid syntax (<ipython-input-24-c30c734cf195>, line 1)